# 1. Найти сумму чисел ряда 1,2,3,...,60 с использованием функции нахождения суммы.
# Использовать локальные переменные.


def func():
    list1 = range(61)
    print(sum(list1))


func()