# 2. Из предложенного текстового файла (text18-31.txt) вывести на экран его содержимое,
# количество символов, принадлежащих к группе букв. Сформировать новый файл, в
# который поместить строку наименьшей длины.


f = open("text18-31.txt.txt", "r", encoding="utf-8")
s = f.read()
print(s)
print()
f.close()

f = open("text18-31.txt.txt", "r", encoding="utf-8")
i = 1
b = str()
znaki = ["а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н", "о",
         "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я",
         "А", "Б", "В", "Г", "Д", "Е", "Ё", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О",
         "П", "Р", "С", "Т", "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Э", "Ю", "Я"]
while i < 140:
    t = f.readline()
    b += t
    i += 1
j = 0
for d in range(0, len(b)):
    if b[d] in znaki:
        j += 1
print("Количество букв: ", j)
f.close()
# А как дальше то?
